Tekla Open API Reference for Tekla Structures 2025
DrawingObjectSelector.SelectObjects Method
 Selects the specified drawing objects in the drawing.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectObjects(
	ArrayList DrawingObjects,
	bool ExtendSelection
)
Public Function SelectObjects (
	DrawingObjects As ArrayList,
	ExtendSelection As Boolean
) As Boolean
Parameters
DrawingObjects
Type: System.Collections.ArrayList
The drawing objects to be selected.
ExtendSelection
Type: System.Boolean
Defines whether the selector keeps the currently selected objects selected or not.
Return Value
Type: Boolean
True if succeeded.
See Also
Reference
DrawingObjectSelector Class
Tekla.Structures.Drawing.UI Namespace